In [3]:
# Dataframes - Handling Missing Values

import numpy as np
import pandas as pd

In [4]:
# Index Alignment 

# For binary operations on Series or DataFrame objects, Pandas will align indices in 
# the process of performing the operation. 
# For missing index in one of the structures python will fill in with NaN - 

A = pd.Series([2, 4, 6], index=[0, 1, 2]) 
B = pd.Series([1, 3, 5], index=[1, 2, 3]) 
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [8]:
# Alternativelly its possible to speciify the fill value for missing elements

A.add(B, fill_value=0)

B.add(A, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [16]:
# Operations with NaN
# NaN is specifically a floating-point value; there is no equivalent NaN value for integers, 
# strings, or other types
# regardless of the operation, the result of arithmetic with NaN will be another NaN

vals2 = np.array([1, np.nan, 3, 4])
a, b, c = vals2.sum(), vals2.min(), vals2.max()
print(a, b, c)

nan nan nan

In [20]:
# but NumPy does provide some special aggregations that will ignore these missing values
a, b, c = np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)
print(a,b,c)

8.0 1.0 4.0

In [21]:
# Detecting Null Values

In [23]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [24]:
# Finding Not Null Values in a Series
data[data.notnull()]

0        1
2    hello
dtype: object

In [25]:
# Dropping Null values - for a series
data.dropna()

0        1
2    hello
dtype: object

In [34]:
# In a DataFrame it's only possible to drop full null rows or columns

df = pd.DataFrame([[1, np.nan, 2], [2, 3, 5], [np.nan, 4, 6]])
df.head()

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [35]:
# By default, dropna() will drop all rows in which any null value is present:

df.dropna()

     0    1  2
1  2.0  3.0  5

In [31]:
# You can specify columns to drop all collumns containing at least one null value

df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [41]:
# Specify a minimum number of non-null values (2) for the row/column to be kept

df.dropna(axis='columns', thresh=2)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [42]:
# Fill null values

# fill NA entries with a single value, such as zero:
data.fillna(0)

0        1
1        0
2    hello
3        0
dtype: object

In [43]:
# specify a forward-fill (or backwar-fill bfill) to propagate the previous value forward
data.fillna(method='ffill')

0        1
1        1
2    hello
3    hello
dtype: object

In [46]:
# for DataFrames we can also specify an axis (1 along columns) along which the fills take place
# if a previous value is not available the NA value will remain
df.fillna(method='ffill', axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0